import { GameStart } from "./game";
import { Level0, Level1, Level2 } from "./levels";

const start = () => 1 as unknown as GameStart<Level0>

start()
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["💣💣📦🌝📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Left
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["💣🎆🌝🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Left
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆🌚🌫️🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Right
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆💣🌝🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Right
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆💣🌫️🌝📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Up
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌝🌫️🌫️"]
["🎆💣🌫️🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Right
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌝🌫️"]
["🎆💣🌫️🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Right
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌝"]
["🎆💣🌫️🌫️📦🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Down
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆💣🌫️🌫️📦🌝"]
["🌲🌲🌲🌲🌲🌲"]
.Left
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆💣🌫️📦🌝🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Left
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆💣📦🌝🌫️🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.Left
["🌫️🌫️🌲🌲🌲🌲"]
["🌲🌲🌲🌫️🌫️🌫️"]
["🎆🎆🌝🌫️🌫️🌫️"]
["🌲🌲🌲🌲🌲🌲"]
.恭喜过关
["🎉🎉🎉🎉🎉"]

